zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/smc.h
/**
 * \brief Component description for PIC32CZ/CA70 SMC
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ_CA70_SMC_COMPONENT_H_
#define _PIC32CZ_CA70_SMC_COMPONENT_H_

/** \addtogroup PIC32CZ_CA70_SMC Static Memory Controller
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR SMC */
/* ========================================================================== */

/* -------- SMC_SETUP : (SMC Offset: 0x00) (R/W 32) SMC Setup Register (CS_number = 0) -------- */

typedef union
{
  struct
  {
    uint32_t NWE_SETUP:6;               /**< bit:   0..5  NWE Setup Length                              */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t NCS_WR_SETUP:6;            /**< bit:  8..13  NCS Setup Length in WRITE Access              */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t NRD_SETUP:6;               /**< bit: 16..21  NRD Setup Length                              */
    uint32_t :2;                        /**< bit: 22..23  Reserved                                      */
    uint32_t NCS_RD_SETUP:6;            /**< bit: 24..29  NCS Setup Length in READ Access               */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __SMC_SETUP_bits_t;

#define SMC_SETUP_NWE_SETUP_Pos               (0)                                            /**< (SMC_SETUP) NWE Setup Length Position */
#define SMC_SETUP_NWE_SETUP_Msk               (0x3FU << SMC_SETUP_NWE_SETUP_Pos)             /**< (SMC_SETUP) NWE Setup Length Mask */
#define SMC_SETUP_NWE_SETUP(value)            (SMC_SETUP_NWE_SETUP_Msk & ((value) << SMC_SETUP_NWE_SETUP_Pos))
#define SMC_SETUP_NCS_WR_SETUP_Pos            (8)                                            /**< (SMC_SETUP) NCS Setup Length in WRITE Access Position */
#define SMC_SETUP_NCS_WR_SETUP_Msk            (0x3FU << SMC_SETUP_NCS_WR_SETUP_Pos)          /**< (SMC_SETUP) NCS Setup Length in WRITE Access Mask */
#define SMC_SETUP_NCS_WR_SETUP(value)         (SMC_SETUP_NCS_WR_SETUP_Msk & ((value) << SMC_SETUP_NCS_WR_SETUP_Pos))
#define SMC_SETUP_NRD_SETUP_Pos               (16)                                           /**< (SMC_SETUP) NRD Setup Length Position */
#define SMC_SETUP_NRD_SETUP_Msk               (0x3FU << SMC_SETUP_NRD_SETUP_Pos)             /**< (SMC_SETUP) NRD Setup Length Mask */
#define SMC_SETUP_NRD_SETUP(value)            (SMC_SETUP_NRD_SETUP_Msk & ((value) << SMC_SETUP_NRD_SETUP_Pos))
#define SMC_SETUP_NCS_RD_SETUP_Pos            (24)                                           /**< (SMC_SETUP) NCS Setup Length in READ Access Position */
#define SMC_SETUP_NCS_RD_SETUP_Msk            (0x3FU << SMC_SETUP_NCS_RD_SETUP_Pos)          /**< (SMC_SETUP) NCS Setup Length in READ Access Mask */
#define SMC_SETUP_NCS_RD_SETUP(value)         (SMC_SETUP_NCS_RD_SETUP_Msk & ((value) << SMC_SETUP_NCS_RD_SETUP_Pos))
#define SMC_SETUP_Msk                         (0x3F3F3F3FUL)                                 /**< (SMC_SETUP) Register Mask  */

/* -------- SMC_PULSE : (SMC Offset: 0x04) (R/W 32) SMC Pulse Register (CS_number = 0) -------- */

typedef union
{
  struct
  {
    uint32_t NWE_PULSE:7;               /**< bit:   0..6  NWE Pulse Length                              */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t NCS_WR_PULSE:7;            /**< bit:  8..14  NCS Pulse Length in WRITE Access              */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t NRD_PULSE:7;               /**< bit: 16..22  NRD Pulse Length                              */
    uint32_t :1;                        /**< bit:     23  Reserved                                      */
    uint32_t NCS_RD_PULSE:7;            /**< bit: 24..30  NCS Pulse Length in READ Access               */
    uint32_t :1;                        /**< bit:     31  Reserved                                      */
  };
  uint32_t w;
} __SMC_PULSE_bits_t;

#define SMC_PULSE_NWE_PULSE_Pos               (0)                                            /**< (SMC_PULSE) NWE Pulse Length Position */
#define SMC_PULSE_NWE_PULSE_Msk               (0x7FU << SMC_PULSE_NWE_PULSE_Pos)             /**< (SMC_PULSE) NWE Pulse Length Mask */
#define SMC_PULSE_NWE_PULSE(value)            (SMC_PULSE_NWE_PULSE_Msk & ((value) << SMC_PULSE_NWE_PULSE_Pos))
#define SMC_PULSE_NCS_WR_PULSE_Pos            (8)                                            /**< (SMC_PULSE) NCS Pulse Length in WRITE Access Position */
#define SMC_PULSE_NCS_WR_PULSE_Msk            (0x7FU << SMC_PULSE_NCS_WR_PULSE_Pos)          /**< (SMC_PULSE) NCS Pulse Length in WRITE Access Mask */
#define SMC_PULSE_NCS_WR_PULSE(value)         (SMC_PULSE_NCS_WR_PULSE_Msk & ((value) << SMC_PULSE_NCS_WR_PULSE_Pos))
#define SMC_PULSE_NRD_PULSE_Pos               (16)                                           /**< (SMC_PULSE) NRD Pulse Length Position */
#define SMC_PULSE_NRD_PULSE_Msk               (0x7FU << SMC_PULSE_NRD_PULSE_Pos)             /**< (SMC_PULSE) NRD Pulse Length Mask */
#define SMC_PULSE_NRD_PULSE(value)            (SMC_PULSE_NRD_PULSE_Msk & ((value) << SMC_PULSE_NRD_PULSE_Pos))
#define SMC_PULSE_NCS_RD_PULSE_Pos            (24)                                           /**< (SMC_PULSE) NCS Pulse Length in READ Access Position */
#define SMC_PULSE_NCS_RD_PULSE_Msk            (0x7FU << SMC_PULSE_NCS_RD_PULSE_Pos)          /**< (SMC_PULSE) NCS Pulse Length in READ Access Mask */
#define SMC_PULSE_NCS_RD_PULSE(value)         (SMC_PULSE_NCS_RD_PULSE_Msk & ((value) << SMC_PULSE_NCS_RD_PULSE_Pos))
#define SMC_PULSE_Msk                         (0x7F7F7F7FUL)                                 /**< (SMC_PULSE) Register Mask  */

