zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/smc.h
/* -------- SMC_CYCLE : (SMC Offset: 0x08) (R/W 32) SMC Cycle Register (CS_number = 0) -------- */

typedef union
{
  struct
  {
    uint32_t NWE_CYCLE:9;               /**< bit:   0..8  Total Write Cycle Length                      */
    uint32_t :7;                        /**< bit:  9..15  Reserved                                      */
    uint32_t NRD_CYCLE:9;               /**< bit: 16..24  Total Read Cycle Length                       */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  uint32_t w;
} __SMC_CYCLE_bits_t;

#define SMC_CYCLE_NWE_CYCLE_Pos               (0)                                            /**< (SMC_CYCLE) Total Write Cycle Length Position */
#define SMC_CYCLE_NWE_CYCLE_Msk               (0x1FFU << SMC_CYCLE_NWE_CYCLE_Pos)            /**< (SMC_CYCLE) Total Write Cycle Length Mask */
#define SMC_CYCLE_NWE_CYCLE(value)            (SMC_CYCLE_NWE_CYCLE_Msk & ((value) << SMC_CYCLE_NWE_CYCLE_Pos))
#define SMC_CYCLE_NRD_CYCLE_Pos               (16)                                           /**< (SMC_CYCLE) Total Read Cycle Length Position */
#define SMC_CYCLE_NRD_CYCLE_Msk               (0x1FFU << SMC_CYCLE_NRD_CYCLE_Pos)            /**< (SMC_CYCLE) Total Read Cycle Length Mask */
#define SMC_CYCLE_NRD_CYCLE(value)            (SMC_CYCLE_NRD_CYCLE_Msk & ((value) << SMC_CYCLE_NRD_CYCLE_Pos))
#define SMC_CYCLE_Msk                         (0x01FF01FFUL)                                 /**< (SMC_CYCLE) Register Mask  */

/* -------- SMC_MODE : (SMC Offset: 0x0c) (R/W 32) SMC Mode Register (CS_number = 0) -------- */

typedef union
{
  struct
  {
    uint32_t READ_MODE:1;               /**< bit:      0  Read Mode                                     */
    uint32_t WRITE_MODE:1;              /**< bit:      1  Write Mode                                    */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t EXNW_MODE:2;               /**< bit:   4..5  NWAIT Mode                                    */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t BAT:1;                     /**< bit:      8  Byte Access Type                              */
    uint32_t :3;                        /**< bit:  9..11  Reserved                                      */
    uint32_t DBW:1;                     /**< bit:     12  Data Bus Width                                */
    uint32_t :3;                        /**< bit: 13..15  Reserved                                      */
    uint32_t TDF_CYCLES:4;              /**< bit: 16..19  Data Float Time                               */
    uint32_t TDF_MODE:1;                /**< bit:     20  TDF Optimization                              */
    uint32_t :3;                        /**< bit: 21..23  Reserved                                      */
    uint32_t PMEN:1;                    /**< bit:     24  Page Mode Enabled                             */
    uint32_t :3;                        /**< bit: 25..27  Reserved                                      */
    uint32_t PS:2;                      /**< bit: 28..29  Page Size                                     */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __SMC_MODE_bits_t;

#define SMC_MODE_READ_MODE_Pos                (0)                                            /**< (SMC_MODE) Read Mode Position */
#define SMC_MODE_READ_MODE_Msk                (0x1U << SMC_MODE_READ_MODE_Pos)               /**< (SMC_MODE) Read Mode Mask */
#define SMC_MODE_WRITE_MODE_Pos               (1)                                            /**< (SMC_MODE) Write Mode Position */
#define SMC_MODE_WRITE_MODE_Msk               (0x1U << SMC_MODE_WRITE_MODE_Pos)              /**< (SMC_MODE) Write Mode Mask */
#define SMC_MODE_EXNW_MODE_Pos                (4)                                            /**< (SMC_MODE) NWAIT Mode Position */
#define SMC_MODE_EXNW_MODE_Msk                (0x3U << SMC_MODE_EXNW_MODE_Pos)               /**< (SMC_MODE) NWAIT Mode Mask */
#define SMC_MODE_EXNW_MODE(value)             (SMC_MODE_EXNW_MODE_Msk & ((value) << SMC_MODE_EXNW_MODE_Pos))
#define   SMC_MODE_EXNW_MODE_DISABLED_Val     (0x0U)                                         /**< (SMC_MODE) Disabled-The NWAIT input signal is ignored on the corresponding chip select.  */
#define   SMC_MODE_EXNW_MODE_FROZEN_Val       (0x2U)                                         /**< (SMC_MODE) Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped.  */
#define   SMC_MODE_EXNW_MODE_READY_Val        (0x3U)                                         /**< (SMC_MODE) Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high.  */
#define SMC_MODE_EXNW_MODE_DISABLED           (SMC_MODE_EXNW_MODE_DISABLED_Val << SMC_MODE_EXNW_MODE_Pos)  /**< (SMC_MODE) Disabled-The NWAIT input signal is ignored on the corresponding chip select. Position  */
#define SMC_MODE_EXNW_MODE_FROZEN             (SMC_MODE_EXNW_MODE_FROZEN_Val << SMC_MODE_EXNW_MODE_Pos)  /**< (SMC_MODE) Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped. Position  */
#define SMC_MODE_EXNW_MODE_READY              (SMC_MODE_EXNW_MODE_READY_Val << SMC_MODE_EXNW_MODE_Pos)  /**< (SMC_MODE) Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high. Position  */
#define SMC_MODE_BAT_Pos                      (8)                                            /**< (SMC_MODE) Byte Access Type Position */
#define SMC_MODE_BAT_Msk                      (0x1U << SMC_MODE_BAT_Pos)                     /**< (SMC_MODE) Byte Access Type Mask */
#define   SMC_MODE_BAT_BYTE_SELECT_Val        (0x0U)                                         /**< (SMC_MODE) Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1.- Read operation is controlled using NCS, NRD, NBS0, NBS1.  */
#define   SMC_MODE_BAT_BYTE_WRITE_Val         (0x1U)                                         /**< (SMC_MODE) Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1.- Read operation is controlled using NCS and NRD.  */
#define SMC_MODE_BAT_BYTE_SELECT              (SMC_MODE_BAT_BYTE_SELECT_Val << SMC_MODE_BAT_Pos)  /**< (SMC_MODE) Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1.- Read operation is controlled using NCS, NRD, NBS0, NBS1. Position  */
#define SMC_MODE_BAT_BYTE_WRITE               (SMC_MODE_BAT_BYTE_WRITE_Val << SMC_MODE_BAT_Pos)  /**< (SMC_MODE) Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1.- Read operation is controlled using NCS and NRD. Position  */
#define SMC_MODE_DBW_Pos                      (12)                                           /**< (SMC_MODE) Data Bus Width Position */
#define SMC_MODE_DBW_Msk                      (0x1U << SMC_MODE_DBW_Pos)                     /**< (SMC_MODE) Data Bus Width Mask */
#define   SMC_MODE_DBW_8_BIT_Val              (0x0U)                                         /**< (SMC_MODE) 8-bit Data Bus  */
#define   SMC_MODE_DBW_16_BIT_Val             (0x1U)                                         /**< (SMC_MODE) 16-bit Data Bus  */
#define SMC_MODE_DBW_8_BIT                    (SMC_MODE_DBW_8_BIT_Val << SMC_MODE_DBW_Pos)   /**< (SMC_MODE) 8-bit Data Bus Position  */
#define SMC_MODE_DBW_16_BIT                   (SMC_MODE_DBW_16_BIT_Val << SMC_MODE_DBW_Pos)  /**< (SMC_MODE) 16-bit Data Bus Position  */
#define SMC_MODE_TDF_CYCLES_Pos               (16)                                           /**< (SMC_MODE) Data Float Time Position */
#define SMC_MODE_TDF_CYCLES_Msk               (0xFU << SMC_MODE_TDF_CYCLES_Pos)              /**< (SMC_MODE) Data Float Time Mask */
#define SMC_MODE_TDF_CYCLES(value)            (SMC_MODE_TDF_CYCLES_Msk & ((value) << SMC_MODE_TDF_CYCLES_Pos))
#define SMC_MODE_TDF_MODE_Pos                 (20)                                           /**< (SMC_MODE) TDF Optimization Position */
#define SMC_MODE_TDF_MODE_Msk                 (0x1U << SMC_MODE_TDF_MODE_Pos)                /**< (SMC_MODE) TDF Optimization Mask */
#define SMC_MODE_PMEN_Pos                     (24)                                           /**< (SMC_MODE) Page Mode Enabled Position */
#define SMC_MODE_PMEN_Msk                     (0x1U << SMC_MODE_PMEN_Pos)                    /**< (SMC_MODE) Page Mode Enabled Mask */
#define SMC_MODE_PS_Pos                       (28)                                           /**< (SMC_MODE) Page Size Position */
#define SMC_MODE_PS_Msk                       (0x3U << SMC_MODE_PS_Pos)                      /**< (SMC_MODE) Page Size Mask */
#define SMC_MODE_PS(value)                    (SMC_MODE_PS_Msk & ((value) << SMC_MODE_PS_Pos))
#define   SMC_MODE_PS_4_BYTE_Val              (0x0U)                                         /**< (SMC_MODE) 4-byte page  */
#define   SMC_MODE_PS_8_BYTE_Val              (0x1U)                                         /**< (SMC_MODE) 8-byte page  */
#define   SMC_MODE_PS_16_BYTE_Val             (0x2U)                                         /**< (SMC_MODE) 16-byte page  */
#define   SMC_MODE_PS_32_BYTE_Val             (0x3U)                                         /**< (SMC_MODE) 32-byte page  */
#define SMC_MODE_PS_4_BYTE                    (SMC_MODE_PS_4_BYTE_Val << SMC_MODE_PS_Pos)    /**< (SMC_MODE) 4-byte page Position  */
#define SMC_MODE_PS_8_BYTE                    (SMC_MODE_PS_8_BYTE_Val << SMC_MODE_PS_Pos)    /**< (SMC_MODE) 8-byte page Position  */
#define SMC_MODE_PS_16_BYTE                   (SMC_MODE_PS_16_BYTE_Val << SMC_MODE_PS_Pos)   /**< (SMC_MODE) 16-byte page Position  */
#define SMC_MODE_PS_32_BYTE                   (SMC_MODE_PS_32_BYTE_Val << SMC_MODE_PS_Pos)   /**< (SMC_MODE) 32-byte page Position  */
#define SMC_MODE_Msk                          (0x311F1133UL)                                 /**< (SMC_MODE) Register Mask  */

/* -------- SMC_OCMS : (SMC Offset: 0x80) (R/W 32) SMC Off-Chip Memory Scrambling Register -------- */

typedef union
{
  struct
  {
    uint32_t SMSE:1;                    /**< bit:      0  Static Memory Controller Scrambling Enable    */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t CS0SE:1;                   /**< bit:      8  Chip Select (x = 0 to 3) Scrambling Enable    */
    uint32_t CS1SE:1;                   /**< bit:      9  Chip Select (x = 0 to 3) Scrambling Enable    */
    uint32_t CS2SE:1;                   /**< bit:     10  Chip Select (x = 0 to 3) Scrambling Enable    */
    uint32_t CS3SE:1;                   /**< bit:     11  Chip Select (x = 0 to 3) Scrambling Enable    */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __SMC_OCMS_bits_t;

