zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/smc.h
#define SMC_OCMS_SMSE_Pos                     (0)                                            /**< (SMC_OCMS) Static Memory Controller Scrambling Enable Position */
#define SMC_OCMS_SMSE_Msk                     (0x1U << SMC_OCMS_SMSE_Pos)                    /**< (SMC_OCMS) Static Memory Controller Scrambling Enable Mask */
#define SMC_OCMS_CS0SE_Pos                    (8)                                            /**< (SMC_OCMS) Chip Select (x = 0 to 3) Scrambling Enable Position */
#define SMC_OCMS_CS0SE_Msk                    (0x1U << SMC_OCMS_CS0SE_Pos)                   /**< (SMC_OCMS) Chip Select (x = 0 to 3) Scrambling Enable Mask */
#define SMC_OCMS_CS1SE_Pos                    (9)                                            /**< (SMC_OCMS) Chip Select (x = 0 to 3) Scrambling Enable Position */
#define SMC_OCMS_CS1SE_Msk                    (0x1U << SMC_OCMS_CS1SE_Pos)                   /**< (SMC_OCMS) Chip Select (x = 0 to 3) Scrambling Enable Mask */
#define SMC_OCMS_CS2SE_Pos                    (10)                                           /**< (SMC_OCMS) Chip Select (x = 0 to 3) Scrambling Enable Position */
#define SMC_OCMS_CS2SE_Msk                    (0x1U << SMC_OCMS_CS2SE_Pos)                   /**< (SMC_OCMS) Chip Select (x = 0 to 3) Scrambling Enable Mask */
#define SMC_OCMS_CS3SE_Pos                    (11)                                           /**< (SMC_OCMS) Chip Select (x = 0 to 3) Scrambling Enable Position */
#define SMC_OCMS_CS3SE_Msk                    (0x1U << SMC_OCMS_CS3SE_Pos)                   /**< (SMC_OCMS) Chip Select (x = 0 to 3) Scrambling Enable Mask */
#define SMC_OCMS_Msk                          (0x00000F01UL)                                 /**< (SMC_OCMS) Register Mask  */

/* -------- SMC_KEY1 : (SMC Offset: 0x84) (/W 32) SMC Off-Chip Memory Scrambling KEY1 Register -------- */

typedef union
{
  struct
  {
    uint32_t KEY1:32;                   /**< bit:  0..31  Off-Chip Memory Scrambling (OCMS) Key Part 1  */
  };
  uint32_t w;
} __SMC_KEY1_bits_t;

#define SMC_KEY1_KEY1_Pos                     (0)                                            /**< (SMC_KEY1) Off-Chip Memory Scrambling (OCMS) Key Part 1 Position */
#define SMC_KEY1_KEY1_Msk                     (0xFFFFFFFFU << SMC_KEY1_KEY1_Pos)             /**< (SMC_KEY1) Off-Chip Memory Scrambling (OCMS) Key Part 1 Mask */
#define SMC_KEY1_KEY1(value)                  (SMC_KEY1_KEY1_Msk & ((value) << SMC_KEY1_KEY1_Pos))
#define SMC_KEY1_Msk                          (0xFFFFFFFFUL)                                 /**< (SMC_KEY1) Register Mask  */

/* -------- SMC_KEY2 : (SMC Offset: 0x88) (/W 32) SMC Off-Chip Memory Scrambling KEY2 Register -------- */

typedef union
{
  struct
  {
    uint32_t KEY2:32;                   /**< bit:  0..31  Off-Chip Memory Scrambling (OCMS) Key Part 2  */
  };
  uint32_t w;
} __SMC_KEY2_bits_t;

#define SMC_KEY2_KEY2_Pos                     (0)                                            /**< (SMC_KEY2) Off-Chip Memory Scrambling (OCMS) Key Part 2 Position */
#define SMC_KEY2_KEY2_Msk                     (0xFFFFFFFFU << SMC_KEY2_KEY2_Pos)             /**< (SMC_KEY2) Off-Chip Memory Scrambling (OCMS) Key Part 2 Mask */
#define SMC_KEY2_KEY2(value)                  (SMC_KEY2_KEY2_Msk & ((value) << SMC_KEY2_KEY2_Pos))
#define SMC_KEY2_Msk                          (0xFFFFFFFFUL)                                 /**< (SMC_KEY2) Register Mask  */

/* -------- SMC_WPMR : (SMC Offset: 0xe4) (R/W 32) SMC Write Protection Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protect Enable                          */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protection Key                          */
  };
  uint32_t w;
} __SMC_WPMR_bits_t;

#define SMC_WPMR_WPEN_Pos                     (0)                                            /**< (SMC_WPMR) Write Protect Enable Position */
#define SMC_WPMR_WPEN_Msk                     (0x1U << SMC_WPMR_WPEN_Pos)                    /**< (SMC_WPMR) Write Protect Enable Mask */
#define SMC_WPMR_WPKEY_Pos                    (8)                                            /**< (SMC_WPMR) Write Protection Key Position */
#define SMC_WPMR_WPKEY_Msk                    (0xFFFFFFU << SMC_WPMR_WPKEY_Pos)              /**< (SMC_WPMR) Write Protection Key Mask */
#define SMC_WPMR_WPKEY(value)                 (SMC_WPMR_WPKEY_Msk & ((value) << SMC_WPMR_WPKEY_Pos))
#define   SMC_WPMR_WPKEY_PASSWD_Val           (0x534D43U)                                    /**< (SMC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define SMC_WPMR_WPKEY_PASSWD                 (SMC_WPMR_WPKEY_PASSWD_Val << SMC_WPMR_WPKEY_Pos)  /**< (SMC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define SMC_WPMR_Msk                          (0xFFFFFF01UL)                                 /**< (SMC_WPMR) Register Mask  */

/* -------- SMC_WPSR : (SMC Offset: 0xe8) (R/ 32) SMC Write Protection Status Register -------- */

typedef union
{
  struct
  {
    uint32_t WPVS:1;                    /**< bit:      0  Write Protection Violation Status             */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPVSRC:16;                 /**< bit:  8..23  Write Protection Violation Source             */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __SMC_WPSR_bits_t;

#define SMC_WPSR_WPVS_Pos                     (0)                                            /**< (SMC_WPSR) Write Protection Violation Status Position */
#define SMC_WPSR_WPVS_Msk                     (0x1U << SMC_WPSR_WPVS_Pos)                    /**< (SMC_WPSR) Write Protection Violation Status Mask */
#define SMC_WPSR_WPVSRC_Pos                   (8)                                            /**< (SMC_WPSR) Write Protection Violation Source Position */
#define SMC_WPSR_WPVSRC_Msk                   (0xFFFFU << SMC_WPSR_WPVSRC_Pos)               /**< (SMC_WPSR) Write Protection Violation Source Mask */
#define SMC_WPSR_WPVSRC(value)                (SMC_WPSR_WPVSRC_Msk & ((value) << SMC_WPSR_WPVSRC_Pos))
#define SMC_WPSR_Msk                          (0x00FFFF01UL)                                 /**< (SMC_WPSR) Register Mask  */

/** \brief SMC_CS_NUMBER register offsets definitions */
#define SMC_SETUP_OFFSET             (0x00)         /**< (SMC_SETUP) SMC Setup Register (CS_number = 0) Offset */
#define SMC_PULSE_OFFSET             (0x04)         /**< (SMC_PULSE) SMC Pulse Register (CS_number = 0) Offset */
#define SMC_CYCLE_OFFSET             (0x08)         /**< (SMC_CYCLE) SMC Cycle Register (CS_number = 0) Offset */
#define SMC_MODE_OFFSET              (0x0C)         /**< (SMC_MODE) SMC Mode Register (CS_number = 0) Offset */
/** \brief SMC register offsets definitions */
#define SMC_OCMS_OFFSET              (0x80)         /**< (SMC_OCMS) SMC Off-Chip Memory Scrambling Register Offset */
#define SMC_KEY1_OFFSET              (0x84)         /**< (SMC_KEY1) SMC Off-Chip Memory Scrambling KEY1 Register Offset */
#define SMC_KEY2_OFFSET              (0x88)         /**< (SMC_KEY2) SMC Off-Chip Memory Scrambling KEY2 Register Offset */
#define SMC_WPMR_OFFSET              (0xE4)         /**< (SMC_WPMR) SMC Write Protection Mode Register Offset */
#define SMC_WPSR_OFFSET              (0xE8)         /**< (SMC_WPSR) SMC Write Protection Status Register Offset */

/** \brief SMC_CS_NUMBER register API structure */
typedef struct
{
  __IO  __SMC_SETUP_bits_t             SMC_SETUP;     /**< Offset: 0x00 (R/W  32) SMC Setup Register (CS_number = 0) */
  __IO  __SMC_PULSE_bits_t             SMC_PULSE;     /**< Offset: 0x04 (R/W  32) SMC Pulse Register (CS_number = 0) */
  __IO  __SMC_CYCLE_bits_t             SMC_CYCLE;     /**< Offset: 0x08 (R/W  32) SMC Cycle Register (CS_number = 0) */
  __IO  __SMC_MODE_bits_t              SMC_MODE;      /**< Offset: 0x0C (R/W  32) SMC Mode Register (CS_number = 0) */
} smccsnumber_registers_t;

#define SMCCSNUMBER_NUMBER 4
/** \brief SMC register API structure */
typedef struct
{
        smccsnumber_registers_t        SMC_CS_NUMBER[SMCCSNUMBER_NUMBER]; /**< Offset: 0x00 SMC Setup Register (CS_number = 0) */
  __I   uint8_t                        Reserved1[0x40];
  __IO  __SMC_OCMS_bits_t              SMC_OCMS;      /**< Offset: 0x80 (R/W  32) SMC Off-Chip Memory Scrambling Register */
  __O   __SMC_KEY1_bits_t              SMC_KEY1;      /**< Offset: 0x84 ( /W  32) SMC Off-Chip Memory Scrambling KEY1 Register */
  __O   __SMC_KEY2_bits_t              SMC_KEY2;      /**< Offset: 0x88 ( /W  32) SMC Off-Chip Memory Scrambling KEY2 Register */
  __I   uint8_t                        Reserved2[0x58];
  __IO  __SMC_WPMR_bits_t              SMC_WPMR;      /**< Offset: 0xE4 (R/W  32) SMC Write Protection Mode Register */
  __I   __SMC_WPSR_bits_t              SMC_WPSR;      /**< Offset: 0xE8 (R/   32) SMC Write Protection Status Register */
} smc_registers_t;
/** @}  end of Static Memory Controller */

#endif /* _PIC32CZ_CA70_SMC_COMPONENT_H_ */
